#include <iostream>
#include "functions.h"

/*
При выполнении задания предусмотреть возможность ввода текста с
клавиатуры. При работе с текстом использовать строки длиной не более 80-
ти символов. Исходный текст и полученный результат вывести на
экран. Считывание элементов производится через метод getchar().iuhh fuck it 

12. Дана строка, состоящая из слов, разделенных пробелами. Разбить
исходную строку на две подстроки, причем первая длиной k символов, если
на k-ю позицию попадает слово, то его следует отнести ко второй строке.
Значение k вводится с клавиатуры.
*/

int main(){

    return 0;
}